# Використовуємо int для роботи з цілими числами
a = int(input("Введіть значення а: "))
b = int(input("Введіть значення b: "))
c = int(input("Введіть значення c: "))
# Перевіряємо значення дискримінанта
d = b ** 2 - 4 * a * c
# В залежності від значення дискримінанта обираємо формулу розрахунку
if d < 0:
    print("Нема наявних дійсних коренів")
elif d == 0:
    x = (b / 2 * a)
    print(x)
elif d > 0:
    if a == 0:
        print("Значення (а) не може рівнятись 0")
    else:
        x = (-b + pow(d, 2)) / (2 * a)
        x1 = (-b - pow(d, 2)) / (2 * a)
        print("Значення x:", x)
        print("{} * ({} ** 2) + {} * {} + {}".format(a, x, b, x, c))
        print("Значення x1:", x1)
        print("{} * ({} ** 2) + {} * {} + {}".format(a, x1, b, x1, c))

# Прошу пояснити, якщо рішення виявилось не вірним.
