# Напишите итератор, который возвращает элементы заданного списка в обратном
# порядке (аналог reversed).
iteration = [1, 5, 8, 9, 14]
for i in iteration[::-1]:
    print(i)