x = 2
y = 8

# сложение
print(x + y)
print(x + 3)
# вычитание
print(x - y)
# произведение
print(x * y)
# деление
print(x / y)
# целочисленное деление
print(x // y)
# остаток от деления
print(x % y)
# возведение в степень
print(x ** y)
# арифметическое выражение
print(3.2 * 0.8 - 2 * 5 - 3 ** 3)
# возведение в степень 0.5 – квадратный корень
print(4 ** 0.5)

z = -2
# модуль числа
print(abs(z))
# квадрат числа
print(pow(z, 2), z ** 2)

m = 3.26234234234
# округление числа до целого и до одного знака после запятой
print(round(m), round(m, 4))
