A = {1, 2, 3, 4, 5}
B = {4, 5, 6, 7, 8}

# Использование оператора |
# Вывод: {1, 2, 3, 4, 5, 6, 7, 8}
print(A | B)

C = {1, 2, 3, 4, 5}
D = {4, 5, 6, 7, 8}
print(C.union(D))

# /=====================/

A = {1, 2, 3, 4, 5}
B = {4, 5, 6, 7, 8}

# Использование оператора &
# Вывод: {4, 5}
print(A & B)

# /=====================/

A = {1, 2, 3, 4, 5}
B = {4, 5, 6, 7, 8}

# Использование оператора - на A
# Вывод: {1, 2, 3}
print(A - B)
print(B - A)
set_1 = (A - B) | (B - A)
print(set_1)
set_2 = (A | B) - (A & B)
print(set_2)

# /=====================/

A = {1, 2, 3, 4, 5}
B = {4, 5, 6, 7, 8}

# Использование оператора ^
# Вывод: {1, 2, 3, 6, 7, 8}
print(A ^ B)

# /=====================/

