# Создайте список и введите его значения. Найдите наибольший и наименьший
# элемент списка, а также сумму и среднее арифметическое его значений.
my_list = [35, 51, 96, 3, 14, 5, 2, 18, 16, 55]
print("Список:", my_list)
print("мінімальне значення", min(my_list))
print("максимальне значення", max(my_list))
print("сумма всіх значень", sum(my_list))
print("середнє арифметичне", sum(my_list) / len(my_list))
