# Создайте список, введите количество его элементов и сами значения, выведите эти значения на экран в обратном порядке.
my_list = [35, 51, 96, 3, 14, 5, 2, 18, 16, 55]
print(my_list[::-1])
print(my_list.reverse(my_list))